{
  "backend/main.mo": "Motoko backend defining roles, user profiles, authorization helpers, and profile management with state stored in maps and sets.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected files, components, and test IDs for recent app changes.",
  "frontend-file-summaries.txt": "Reference file containing prewritten summaries of many frontend source files for build and documentation use.",
  "frontend/index.css": "Tailwind-based global styles defining AquaFlow color variables and light/dark theme mappings.",
  "frontend/index.html": "HTML entry point setting up root container, favicon, metadata, and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Main app router handling authentication, profile loading, onboarding redirects, protected routes, and error screens.",
  "frontend/src/components/AppShell.tsx": "Layout shell with navigation, header, user info, notifications, logout handling, and routed content display.",
  "frontend/src/components/AuthProfileLoadErrorScreen.tsx": "Error screen component that displays profile loading failures with retry and logout actions.",
  "frontend/src/components/NotificationsBell.tsx": "UI component showing a notifications bell popover with mock unread notifications.",
  "frontend/src/features/reports/pdfGenerator.ts": "Generates a downloadable HTML-based PDF-like report and shows a success toast.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Hooks for fetching the current user's profile, role, and admin status using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, login, and stored identity loading.",
  "frontend/src/hooks/useQueries.ts": "Mutation hook for saving the caller's user profile with error handling and query invalidation.",
  "frontend/src/index.css": "Tailwind setup defining light and dark theme CSS variables for the app's color system.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, and InternetIdentityProvider.",
  "frontend/src/pages/dashboards/AdminDashboardPage.tsx": "Shows admin metrics, customer lists, deliveries, messages, and filters using mock data.",
  "frontend/src/pages/dashboards/CustomerDashboardPage.tsx": "Provides customer delivery stats, additional bottle requests, and messaging using mock data.",
  "frontend/src/pages/dashboards/SalesmanDashboardPage.tsx": "Allows salesmen to record deliveries and view stats, recent deliveries, and requests using mock data.",
  "frontend/src/pages/LoginPage.tsx": "Handles Internet Identity login and routes users to onboarding or role-based dashboards.",
  "frontend/src/pages/onboarding/AdminOnboardingPage.tsx": "Captures admin name and saves an admin profile before navigating to the admin dashboard.",
  "frontend/src/pages/onboarding/CustomerOnboardingPage.tsx": "Customer onboarding form that saves the user profile with the customer role and navigates to the customer dashboard.",
  "frontend/src/pages/onboarding/RoleSelectionPage.tsx": "Role selection flow where users enter their name, pick a role, and save a profile before being routed to the appropriate dashboard with error handling.",
  "frontend/src/pages/onboarding/SalesmanOnboardingPage.tsx": "Salesman onboarding form that saves the user profile with the salesman role and redirects to the salesman dashboard.",
  "frontend/src/pages/ReportsPage.tsx": "Displays report options based on user role and generates mock PDF reports.",
  "frontend/src/utils/currency.ts": "Utility functions to format numbers as AED currency and per-bottle rates.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based query params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, typography, container queries, animations, and theme extensions.",
  "project_state.json": "Metadata describing project state, architecture notes, known issues, and existing feature records for the AquaFlow app."
}