{
  "backend/main.mo": "Defines an actor with access control, user profiles, customer structures, authorization helpers, and profile management logic with role checks.",
  "feature_evidence.json": "Feature evidence report listing files, components, and tests related to rollback from draft version 8 to version 6.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing key frontend files and their functionality.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point setting AquaFlow metadata, favicon, and bootstrapping the React app.",
  "frontend/src/App.tsx": "Main React app with Internet Identity auth, deterministic bootstrap timeout, profile fetch handling, and role‑based routing.",
  "frontend/src/components/AppShell.tsx": "Responsive application shell with navigation, branding, notifications, and logout workflow.",
  "frontend/src/components/AuthBootstrapRecoveryScreen.tsx": "Timeout recovery screen offering retry and session‑clearing options when app bootstrap exceeds time limits.",
  "frontend/src/components/AuthProfileLoadErrorScreen.tsx": "UI screen showing profile load errors with retry and logout actions based on sanitized error messages.",
  "frontend/src/components/NotificationsBell.tsx": "Notification bell component displaying mock unread notifications inside a popover.",
  "frontend/src/config/branding.ts": "Centralized branding object defining app name, tagline, location, and description.",
  "frontend/src/features/reports/pdfGenerator.ts": "Generates a styled HTML-based PDF report including branding, logo, metadata, and tabular data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useCurrentUser.ts": "Hooks for fetching the caller's user profile, role, and admin status with detailed state flags.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login/clear functions, and identity initialization.",
  "frontend/src/hooks/useQueries.ts": "Mutation hook for saving the caller's user profile with error handling and cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS theme definitions for light and dark modes with water-themed color variables.",
  "frontend/src/main.tsx": "Application entry point configuring React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/dashboards/AdminDashboardPage.tsx": "Shows admin metrics and mock data tables for customers, deliveries, messages, and requests.",
  "frontend/src/pages/dashboards/CustomerDashboardPage.tsx": "Provides customers with delivery stats, request forms, and history using mock data.",
  "frontend/src/pages/dashboards/SalesmanDashboardPage.tsx": "Allows salesmen to record deliveries, view stats, and review recent activity with mock data.",
  "frontend/src/pages/LoginPage.tsx": "Handles Internet Identity login and routes users to onboarding or role-based dashboards.",
  "frontend/src/pages/onboarding/AdminOnboardingPage.tsx": "Admin onboarding form that saves profile data and redirects to the admin dashboard.",
  "frontend/src/pages/onboarding/CustomerOnboardingPage.tsx": "Customer onboarding form that saves the user's profile with a customer role and redirects to the customer dashboard.",
  "frontend/src/pages/onboarding/RoleSelectionPage.tsx": "Role selection screen allowing users to enter their name, choose a role, save their profile, and navigate to the appropriate dashboard with error handling.",
  "frontend/src/pages/onboarding/SalesmanOnboardingPage.tsx": "Salesman onboarding form that creates a salesman profile and redirects to the salesman dashboard.",
  "frontend/src/pages/ReportsPage.tsx": "Displays available report options based on user role and generates mock PDF reports.",
  "frontend/src/utils/currency.ts": "Utility functions for formatting AED currency values and per-bottle AED rates.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters using both query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, and plugin setup.",
  "project_state.json": "Metadata describing project state, branding changes, architecture notes, known issues, and existing features."
}