{
  "backend/main.mo": "Motoko backend defining roles, user profiles, customer records, authorization helpers, and profile‑based access checks with state stored in maps and sets.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of key frontend files across onboarding, dashboards, routing, styling, and report generation.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables for light/dark themes and applying base UI styles.",
  "frontend/index.html": "HTML entry point setting metadata, favicon, and mounting the root React application.",
  "frontend/src/App.tsx": "Main routing and bootstrap controller handling identity, profile fetching, deterministic timeout recovery, onboarding redirects, and authenticated app shell rendering.",
  "frontend/src/components/AppShell.tsx": "Responsive app layout with header, navigation, notifications, and logout logic, wrapping routed dashboard and reports pages.",
  "frontend/src/components/AuthBootstrapRecoveryScreen.tsx": "Displays a timeout screen with retry and session-clear options when app bootstrap takes too long.",
  "frontend/src/components/AuthProfileLoadErrorScreen.tsx": "Shows a detailed profile load error with retry and logout options, including sanitized messages.",
  "frontend/src/components/NotificationsBell.tsx": "Renders a notifications popover with a mock unread counter and list display.",
  "frontend/src/config/branding.ts": "Defines centralized branding constants such as app name, tagline, and location.",
  "frontend/src/features/reports/pdfGenerator.ts": "Generates an HTML-based PDF report, embedding logo, branding, and tabular report data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides hooks to fetch the caller’s user profile, role, and admin status with detailed loading states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context with login, clear, and identity state management.",
  "frontend/src/hooks/useQueries.ts": "Defines mutation hook to save the caller’s user profile with success and error handling.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light/dark theme CSS variables for the app's color system.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/dashboards/AdminDashboardPage.tsx": "Shows admin stats and mock data tables for customers, deliveries, messages, and requests.",
  "frontend/src/pages/dashboards/CustomerDashboardPage.tsx": "Provides customer stats, delivery history, and forms for bottle requests and support messages.",
  "frontend/src/pages/dashboards/SalesmanDashboardPage.tsx": "Shows salesman stats, recent deliveries, and a form to record delivery activity with mock data.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login UI and routes users to onboarding or their role-specific dashboard after authentication.",
  "frontend/src/pages/onboarding/AdminOnboardingPage.tsx": "Admin onboarding form that saves the user's profile with admin role and redirects to the admin dashboard.",
  "frontend/src/pages/onboarding/CustomerOnboardingPage.tsx": "Customer onboarding page allowing name and optional address entry, saving a customer profile and navigating to the customer dashboard.",
  "frontend/src/pages/onboarding/RoleSelectionPage.tsx": "Role selection flow where users enter their name, choose a role, save their profile, and are routed to the matching dashboard with error handling.",
  "frontend/src/pages/onboarding/SalesmanOnboardingPage.tsx": "Salesman onboarding form that creates a salesman profile and redirects to the salesman dashboard.",
  "frontend/src/pages/ReportsPage.tsx": "Displays available reports and generates mock PDF reports based on user role.",
  "frontend/src/utils/currency.ts": "Utility functions for formatting AED currency amounts and bottle rates.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL and session parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugin setup.",
  "project_state.json": "Tracks project version, rebranding goals, architectural notes, known issues, and existing feature definitions. Indicates the project is in a fix-request state with multiple blocked authentication and deployment flows."
}