{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Deterministic auth/profile bootstrap timeout and recovery to prevent infinite loading",
  "requirements": [
    {
      "id": "REQ-32",
      "summary": "Add a deterministic timeout to the root auth bootstrap loading screen and provide an automatic recovery UI with Retry and Clear Session actions.",
      "acceptanceCriteria": [
        "If the app remains in the global loading state for longer than a fixed threshold (e.g., 10–15 seconds), it must automatically switch to a non-loading recovery screen instead of spinning forever.",
        "The recovery screen must include at least: (1) a \"Retry\" action that re-attempts profile loading, and (2) a \"Log out\" / \"Clear session\" action that clears the Internet Identity session and returns the user to /login.",
        "User-facing text on the loading/recovery screen must be in English and must use the current branding name \"Blue Nile\".",
        "A user who previously experienced an infinite loading screen can always reach either the Login page or the Onboarding page using the provided recovery actions (no dead-end state)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AuthBootstrapRecoveryScreen.tsx",
          "operation": "create",
          "description": "Create a dedicated bootstrap recovery screen shown after a global bootstrap timeout. Use shadcn-ui composed components (e.g., Card, Alert, Button) to display English messaging referencing the Blue Nile branding, plus actions: Retry (invalidate/refetch current user profile query) and Clear session (call Internet Identity clear, clear React Query cache, and navigate to /login). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the RootComponent global bootstrap flow (\"Loading Blue Nile...\") to start a deterministic timer (10–15s) whenever it enters the global loading state; when the timer elapses, automatically render AuthBootstrapRecoveryScreen instead of spinning indefinitely. Wire Retry to reset the timeout state and trigger a fresh profile-load attempt; wire Clear session to always navigate the user to /login. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Ensure authenticated bootstrap routing shows an actionable error/retry state when the actor/profile query is not ready or fails, instead of blank/stuck UI.",
      "acceptanceCriteria": [
        "When the user is authenticated but the profile cannot be fetched (e.g., backend not reachable, actor not initialized), the app must show an error state (e.g., reuse the existing profile-load error screen pattern) with a retry option rather than staying on an endless spinner.",
        "Retry must trigger a fresh attempt to fetch the caller profile (e.g., invalidate/refetch the current user profile query).",
        "Logging out from this error state must clear the identity and leave the user on /login (or able to navigate to /login) without re-entering the same stuck loading state immediately."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AuthProfileLoadErrorScreen.tsx",
          "operation": "modify",
          "description": "Enhance the existing profile-load error UI so both Retry and Log Out are fully actionable from any bootstrap failure state: Retry should invalidate/refetch the current user profile query; Log Out should call Internet Identity clear, clear React Query cache, and navigate to /login to avoid returning to a blank/stuck state. Keep all user-facing text in English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Harden routing components (RootComponent/ProtectedRoute/ProfileRequiredRoute/IndexComponent) so they never return a blank null screen during authenticated bootstrap uncertainty (e.g., actor not yet available). Reuse AuthProfileLoadErrorScreen (or the new AuthBootstrapRecoveryScreen for timeouts) to show actionable Retry/Log Out UI rather than endless spinners or empty renders. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Standardize current-user profile query state reporting so the router/bootstrap can deterministically choose between loading, onboarding redirect, app shell, and error recovery.",
      "acceptanceCriteria": [
        "The bootstrap layer (App routing/root component) can reliably distinguish between: (1) still initializing Internet Identity, (2) authenticated + profile fetch in progress, (3) authenticated + no profile exists, (4) authenticated + profile exists, and (5) authenticated + profile fetch failed.",
        "Authenticated users with no saved profile are redirected to /onboarding once the system has enough information to decide (no infinite loops).",
        "Authenticated users with an existing profile are routed into the authenticated app shell/dashboards once fetched (no infinite loops)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useCurrentUser.ts",
          "operation": "modify",
          "description": "Update useGetCallerUserProfile to expose consistent readiness/phase flags to the bootstrap layer (e.g., actor dependency readiness, fetch-in-progress vs not-started, fetched-success with null vs non-null, and failure). Ensure the hook remains compatible with React Query and avoids oscillation by clearly separating actor readiness from profile fetch completion. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Refactor bootstrap decision-making to use the enhanced useGetCallerUserProfile state so it can deterministically select among: II initializing, authenticated+fetching, authenticated+no profile (redirect /onboarding), authenticated+has profile (render AppShell), and authenticated+failed (render error screen). Ensure redirects happen only once the system is ready to decide to prevent infinite loops. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}