{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Rollback frontend to Version 6 experience (remove Version 8 branding/assets and restore Version 6 UI)",
  "requirements": [
    {
      "id": "REQ-35",
      "summary": "Restore the production-served frontend to match Version 6 (remove Version 8 UI/branding/assets references and ensure a hard refresh loads the Version 6 experience).",
      "acceptanceCriteria": [
        "Production no longer serves the Draft Version 8 build.",
        "Production serves the same frontend and backend code/state behavior as Version 6.",
        "A hard refresh in the browser loads the Version 6 experience (no cached Version 8 assets being referenced).",
        "No new functional or UI changes are introduced beyond restoring Version 6."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/branding.ts",
          "operation": "modify",
          "description": "Revert centralized branding constants to the exact Version 6 values (app name/tagline/location/description) so all user-facing copy matches Version 6."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Revert Version 8 document metadata (title/description/favicon) back to the Version 6 values and ensure the favicon references the Version 6 generated asset under frontend/public/assets/generated/ (e.g., switch away from blue-nile icon if Version 6 used a different one)."
        },
        {
          "path": "frontend/src/components/AppShell.tsx",
          "operation": "modify",
          "description": "Revert header/navigation/footer visuals to Version 6, including restoring Version 6 logo/icon references by updating image sources to the correct generated assets (e.g., use frontend/public/assets/generated/aquaflow-icon.dim_256x256.png instead of any Version 8 blue-nile assets if Version 6 used AquaFlow)."
        },
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Revert the login page presentation to the Version 6 design by restoring Version 6 background/header imagery and icon references (e.g., switch to frontend/public/assets/generated/aquaflow-header-bg.dim_1600x400.png and frontend/public/assets/generated/aquaflow-icon.dim_256x256.png if those were the Version 6 assets), ensuring no Version 8 assets are referenced."
        },
        {
          "path": "frontend/src/features/reports/pdfGenerator.ts",
          "operation": "modify",
          "description": "Revert report branding to Version 6 by restoring the Version 6 logo/icon asset used for embedding (update fetch() path away from any Version 8 blue-nile asset to the Version 6 generated asset, e.g., frontend/public/assets/generated/aquaflow-icon.dim_256x256.png) and ensure it uses the Version 6 BRANDING values."
        },
        {
          "path": "frontend/src/pages/ReportsPage.tsx",
          "operation": "modify",
          "description": "Revert any Version 8 report-screen copy that names Version 8 branding (e.g., references to “Blue Nile company logo and branding”) back to the Version 6 wording consistent with frontend/src/config/branding.ts."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Revert routing/bootstrap UI behavior to match Version 6 (including any Version 8-only recovery/loading/error screen flows) while keeping the app’s authenticated navigation consistent with Version 6 and ensuring no new functional changes beyond the rollback."
        }
      ]
    }
  ]
}